export function sumNumbers(a, b) {
    return a + b;
}
//Със export я екпортираме и вече всички останали модули ще могат да я ползват.

export function numberProduct(a, b) {
    return a * b;
}

//Можем да ги експортираме и накрая без да пишем export преди всяка функция.
// export {
//     sumNumbers,
//     numberProduct
// }

//Можем и да имаме export default, като всеки файл може да има само един дефолтен експорт, който после при импортирането можем да го импортем със следния запис:
//import MyPerson (примерно) from 'пътя'. Тоест тук не са ни необходими къдрави скоби, като можем директно и да променим името на функцията при импорта.
//Препоръчват се наименуваните експорти.