export function renderTemplate(templateAsString, data) {
    const pattern = /{{(.+?)}}/gm;

    return templateAsString.replace(pattern, (...params) => {
        return data[params[1]]; //От подадената data индексираме по propName. data са данните от data.json файла, като имената на пропертитата в data.json файла и тези, които са в article.html който в случая ни се явява шаблона, трябва да са еднакви за да може да работи.
        // console.log(params); //chema1.jpg
    });

    //Можем да използваме функцията replace като и подадем друга функция и така да правим промени динамично. Подаваме патерна и параметрите, които ще приеме функцията през params са - получаваме масив от три елемента, защото имаме три съвпадения. data в случая са данните от файла article.html върху който използваме регекса за да намерим съвпадения. Първия елемент е точно намерения елемент във файла article.html съгласно патерна, а втория е групата, която сме задали в регекса (params[1]). Фигура chema1.jpg. String.replace като функция работи така, че намерените съвпадения ще бъдат заместени с това, което сме върнали.
}